{"modelTopology":{"class_name":"Sequential","config":{"name":"sequential_1","layers":[{"class_name":"Dense","config":{"units":50,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1","trainable":true,"batch_input_shape":[null,450],"dtype":"float32"}},{"class_name":"Reshape","config":{"target_shape":[10,5],"name":"reshape_Reshape1","trainable":true}},{"class_name":"RNN","config":{"return_sequences":false,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false,"cell":{"class_name":"StackedRNNCells","config":{"cells":[{"class_name":"LSTMCell","config":{"units":20,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":null,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":null,"name":"lstm_cell_LSTMCell1","trainable":true}},{"class_name":"LSTMCell","config":{"units":20,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":null,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":null,"name":"lstm_cell_LSTMCell2","trainable":true}},{"class_name":"LSTMCell","config":{"units":20,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":null,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":null,"name":"lstm_cell_LSTMCell3","trainable":true}},{"class_name":"LSTMCell","config":{"units":20,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":null,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":null,"name":"lstm_cell_LSTMCell4","trainable":true}}],"name":"stacked_rnn_cells_StackedRNNCells1","trainable":true}},"name":"rnn_RNN1","trainable":true,"batch_input_shape":[null,10,5],"dtype":"float32"}},{"class_name":"Dense","config":{"units":1,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2","trainable":true,"batch_input_shape":[null,20],"dtype":"float32"}}]},"keras_version":"tfjs-layers 1.7.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v1.7.0","convertedBy":null,"weightsManifest":[{"paths":["./model.weights.bin"],"weights":[{"name":"dense_Dense1/kernel","shape":[450,50],"dtype":"float32"},{"name":"dense_Dense1/bias","shape":[50],"dtype":"float32"},{"name":"rnn_RNN1/RNNCell_0/kernel","shape":[5,80],"dtype":"float32"},{"name":"rnn_RNN1/RNNCell_0/recurrent_kernel","shape":[20,80],"dtype":"float32"},{"name":"rnn_RNN1/RNNCell_0/bias","shape":[80],"dtype":"float32"},{"name":"rnn_RNN1/RNNCell_1/kernel","shape":[20,80],"dtype":"float32"},{"name":"rnn_RNN1/RNNCell_1/recurrent_kernel","shape":[20,80],"dtype":"float32"},{"name":"rnn_RNN1/RNNCell_1/bias","shape":[80],"dtype":"float32"},{"name":"rnn_RNN1/RNNCell_2/kernel","shape":[20,80],"dtype":"float32"},{"name":"rnn_RNN1/RNNCell_2/recurrent_kernel","shape":[20,80],"dtype":"float32"},{"name":"rnn_RNN1/RNNCell_2/bias","shape":[80],"dtype":"float32"},{"name":"rnn_RNN1/RNNCell_3/kernel","shape":[20,80],"dtype":"float32"},{"name":"rnn_RNN1/RNNCell_3/recurrent_kernel","shape":[20,80],"dtype":"float32"},{"name":"rnn_RNN1/RNNCell_3/bias","shape":[80],"dtype":"float32"},{"name":"dense_Dense2/kernel","shape":[20,1],"dtype":"float32"},{"name":"dense_Dense2/bias","shape":[1],"dtype":"float32"}]}]}